const inventory = [];
let room = "улица";

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст. Вы ничего не взяли.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "ПУТЬ К ТРЕНИРОВКЕ\n\n" +
    "Вам нужно собрать всё необходимое и прийти на плац.\n" +
    "Что нужно найти: шлем, тренер, седло, вальтрап, подпруга, уздечка, лошадь, хлыст.\n" +
    "Не забудьте про морковь для лошади!"
);

while (true) {
    // УЛИЦА 
    if (room === "улица") {
        const choice = prompt(
            "ВЫ НА УЛИЦЕ\n" +
            "1 — В манеж (взять хлыст)\n" +
            "2 — В дом\n" +
            "3 — В конюшню\n" +
            "4 — На плац (тренировка)\n" +
            "5 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) break;
        else if (choice === "1") {
            room = "манеж";
        } else if (choice === "2") {
            room = "дом";
        } else if (choice === "3") {
            room = "конюшня";
        } else if (choice === "4") {
            if (!inventory.includes("лошадь")) {
                alert("Без лошади на плацу делать нечего.");
                room = "улица";
                continue;
            } else {
                room = "плац";
            }
        
        } else if (choice === "5") {
            showInventory();
        } else alert("Нет такого варианта.");
    }

    // ДОМ 
    else if (room === "дом") {
        const choice = prompt(
            "ДОМ\n" +
            "1 — Зайти в тренерскую\n" +
            "2 — Зайти в раздевалку\n" +
            "3 — Выйти на улицу\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) break;
        else if (choice === "1") room = "тренерская";
        else if (choice === "2") room = "раздевалка";
        else if (choice === "3") room = "улица";
        else alert("Нет такого варианта.");
    }

    // ТРЕНЕРСКАЯ (поговорить с тренером)
    else if (room === "тренерская") {
        const choice = prompt(
            "ТРЕНЕРСКАЯ\n" +
            "1 – Поговорить с тренером\n" +
            "2 – Выйти в дом\n" +
            "0 — Завершить игру"
        )
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            if (inventory.includes("тренер")) {
                alert("вы уже знаете что вам делать, не отвлекай лишний раз");
            } else {
                const takeKey = confirm("поговорить с тренером?");

                if (takeKey === true) {
                    inventory.push("тренер");
                    alert("обьясняет правила");
                } else {
                    alert("Вы оставили тренера в покое.\n" +
                        "но что вам делать?");
                }
            }
        } else if (choice === "2") {
            room = "дом";
        } else {
            alert("Такого действия нет.");
        }
    }

    // РАЗДЕВАЛКА (ВЗЯТЬ ШЛЕМ)
    else if (room === "раздевалка") {

    }

    // КОНЮШНЯ (МЕНЮ ПЕРЕХОДОВ  1 - В денник, 2 - В кормовую, 3 - В амуничник, 4 - На улицу.)
    else if (room === "конюшня") {
// добавить 3 денника ( кузя зара федя)
    }

    // ДЕННИК (ВЗЯТЬ ЛОШАДЬ)
    else if (room === "денник Кузи") {
        // сначала берем лошадь 
// и потом передаем амуницию в массив 

    }  else if (room === "денник Феди"){
        //частная лошадь, не входить,
        //все равно зайти- игра окончена
        //пройтти мимо- обратно в конюшню

    }

    // КОРМОВАЯ (ВЗЯТЬ МОРКОВЬ)
    else if (room === "кормовая") {

    }

    // АМУНИЧНИК (ВЗЯТЬ ЭКИПИРОВКУ)
    else if (room === "амуничник") {
        // седло вальтрап уздечка подпруга
    }
    // МАНЕЖ (ВЗЯТЬ ХЛЫСТ)
    else if (room === "манеж") {
        // поздороваться с конюхом и взять хлыст
    }

    // ПЛАЦ (ФИНАЛ)
    else if (room === "плац") {

        const choice = prompt(
            "ПЛАЦ\n" +
            "1 — Начать тренировку\n" +
            "2 — Вернуться на улицу\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) break;
        else if (choice === "2") room = "улица";
        else if (choice === "1") {

           //обязательно поговорить с тренером,
           // взять хлыст шлем если нет то подумай о безопасности
           // если нет седло вальтрап уздечка подпруга, то ты не поседлал лошадь
           //если имя лошади не кузя то ты привел не ту лошадь
           //если есть морковка то в коце тренировки похвалили лошадь
        }
    }
}
alert("Игра завершена.");